site.org
#+STARTUP: logdone
#+hugo_base_dir: .
#+title: blog title

* DONE Media
  CLOSED: [2020-06-24 Wed 16:30]
:PROPERTIES:
:EXPORT_HUGO_SECTION: media
:export_file_name: _index
:END:

** DONE Nemesis Games :book: 
   CLOSED: [2020-06-17 Wed 03:24]
:PROPERTIES:
:export_file_name: nemesis-games
:END:

Pretty good, see my goodreads.

** DONE 1917 :movie:
   CLOSED: [2020-06-24 Wed 16:05]
:PROPERTIES:
:export_file_name: 1917
:END:


1917 last night, 7pm showing. sitting way close wasn't bad. maybe wish
i hadn't known about the single cut nature of it. was definitely some
cuts, but overall very close to not noticable.  ww1 movie. two guys go
on a trip to serve orders to warn and prevent a massacre. comes close
to happening anyway

The following stream-of-consciousness remembrance of how the movie went was written the following morning:

meadow, british trenches, no mans land, geran trenches, german
artillery line, traded away my metal (bit of tin with a ribbon),
cherry orchard, house, plane attack, deadth, trucks, bridge oeer
river, sniper, knockout blacknesss, flares through the night in town,
burning building, charse, flee, baby underground basement, morning
bells of church, sneaking, flee, jump into river, river survival, dead
men clogging up the rver, sining in a dell, moving up new trench
lines, run out across new no mans land, deliver orders, call off the
attack, move back into triage area, find brother, take a break, back
to tree in meadow, look at pictures of wife and kids.

urn:uuid:e0dafbb9-6974-4008-a43b-14a86fcc238c

** DONE just mercy                                                    :movie:
   CLOSED: [2020-07-13 Mon 23:49]
:PROPERTIES:
:export_file_name: just mercy
:END:

death row inmates

Given flaws in the system, I must be against the death penalty. Among other reasons.

** DONE dark waters                                                   :movie:
   CLOSED: [2020-07-13 Mon 23:49]
:PROPERTIES:
:export_file_name: dark waters
:END:

dow du pont c8 teflon

