content/media/_index.md
+++
title = "Media"
date = 2020-06-24T16:30:00-07:00
draft = false
+++

## <span class="org-todo done DONE">DONE</span> Nemesis Games {#nemesis-games}

Pretty good, see my goodreads.


## <span class="org-todo done DONE">DONE</span> 1917 {#1917}

1917 last night, 7pm showing. sitting way close wasn't bad. maybe wish
i hadn't known about the single cut nature of it. was definitely some
cuts, but overall very close to not noticable.  ww1 movie. two guys go
on a trip to serve orders to warn and prevent a massacre. comes close
to happening anyway

The following stream-of-consciousness remembrance of how the movie went was written the following morning:

meadow, british trenches, no mans land, geran trenches, german
artillery line, traded away my metal (bit of tin with a ribbon),
cherry orchard, house, plane attack, deadth, trucks, bridge oeer
river, sniper, knockout blacknesss, flares through the night in town,
burning building, charse, flee, baby underground basement, morning
bells of church, sneaking, flee, jump into river, river survival, dead
men clogging up the rver, sining in a dell, moving up new trench
lines, run out across new no mans land, deliver orders, call off the
attack, move back into triage area, find brother, take a break, back
to tree in meadow, look at pictures of wife and kids.

urn:uuid:e0dafbb9-6974-4008-a43b-14a86fcc238c


## <span class="org-todo done DONE">DONE</span> just mercy {#just-mercy}

death row inmates

Given flaws in the system, I must be against the death penalty. Among other reasons.


## <span class="org-todo done DONE">DONE</span> dark waters {#dark-waters}

dow du pont c8 teflon